# Topic- Pandas (Merging Joining and Concatenating.)

In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']},index=[0,1,2,3])

In [3]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [4]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],'C':['C4','C5','C6','C7'],'D':['D4','D5','D6','D7']},index=[4,5,6,7])

In [5]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],'B':['B8','B9','B10','B11'],'C':['C8','C9','C10','C11'],'D':['D8','D9','D10','D11']},index=[8,9,10,11])

In [6]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [7]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [8]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [11]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [15]:
df=pd.concat([df1,df2,df3],axis=1)

In [16]:
df

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [17]:
df.dropna()

Empty DataFrame
Columns: [A, B, C, D, A, B, C, D, A, B, C, D]
Index: []

In [18]:
df.fillna('None')

       A     B     C     D     A     B     C     D     A     B     C     D
0     A0    B0    C0    D0  None  None  None  None  None  None  None  None
1     A1    B1    C1    D1  None  None  None  None  None  None  None  None
2     A2    B2    C2    D2  None  None  None  None  None  None  None  None
3     A3    B3    C3    D3  None  None  None  None  None  None  None  None
4   None  None  None  None    A4    B4    C4    D4  None  None  None  None
5   None  None  None  None    A5    B5    C5    D5  None  None  None  None
6   None  None  None  None    A6    B6    C6    D6  None  None  None  None
7   None  None  None  None    A7    B7    C7    D7  None  None  None  None
8   None  None  None  None  None  None  None  None    A8    B8    C8    D8
9   None  None  None  None  None  None  None  None    A9    B9    C9    D9
10  None  None  None  None  None  None  None  None   A10   B10   C10   D10
11  None  None  None  None  None  None  None  None   A11   B11   C11   D11

In [19]:
df.fillna(' * ')

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0   *    *    *    *    *    *    *    *
1    A1   B1   C1   D1   *    *    *    *    *    *    *    *
2    A2   B2   C2   D2   *    *    *    *    *    *    *    *
3    A3   B3   C3   D3   *    *    *    *    *    *    *    *
4    *    *    *    *    A4   B4   C4   D4   *    *    *    *
5    *    *    *    *    A5   B5   C5   D5   *    *    *    *
6    *    *    *    *    A6   B6   C6   D6   *    *    *    *
7    *    *    *    *    A7   B7   C7   D7   *    *    *    *
8    *    *    *    *    *    *    *    *    A8   B8   C8   D8
9    *    *    *    *    *    *    *    *    A9   B9   C9   D9
10   *    *    *    *    *    *    *    *   A10  B10  C10  D10
11   *    *    *    *    *    *    *    *   A11  B11  C11  D11

In [21]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key':['k0','k1','k2','k3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [22]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [23]:
right

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [26]:
df=pd.concat([left,right])

In [28]:
df.fillna('*')

  key   A   B   C   D
0  K0  A0  B0   *   *
1  K1  A1  B1   *   *
2  K2  A2  B2   *   *
3  K3  A3  B3   *   *
0  k0   *   *  C0  D0
1  k1   *   *  C1  D1
2  k2   *   *  C2  D2
3  k3   *   *  C3  D3

In [39]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [40]:
right

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [41]:
# pd.merge(left,right)

In [43]:
pd.merge(left , right ,how='inner',on='key')

Empty DataFrame
Columns: [key, A, B, C, D]
Index: []

In [50]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [51]:
df1=pd.merge(left,right,how='inner',on='key')

In [52]:
df1

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [53]:
df5=pd.DataFrame({'key':['K5','K6','K7','K8'],
                 'A':['A5','A6','A7','A8'],
                 'B':['B5','B6','B7','B8']})
df6=pd.DataFrame({'key':['K5','K6','K7','K8'],
                  'C':['C5','C6','C7','C8'],
                  'D':['D5','D6','D7','D8']})

In [54]:
pd.merge(df5,df6)

  key   A   B   C   D
0  K5  A5  B5  C5  D5
1  K6  A6  B6  C6  D6
2  K7  A7  B7  C7  D7
3  K8  A8  B8  C8  D8

In [63]:
left=pd.DataFrame({'key1':['K5','K6','K7','K8'],
                  'key2':['K5','K6','K5','K6'],
                 'A':['A5','A6','A7','A8'],
                 'B':['B5','B6','B7','B8']})
right=pd.DataFrame({'key1':['K5','K6','K7','K8'],
        'key2':['K5','K5','K5','K5'],
                  'C':['C5','C6','C7','C8'],
                  'D':['D5','D6','D7','D8']})

In [66]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K5   K5  A5  B5  C5  D5
1   K7   K5  A7  B7  C7  D7

In [67]:
pd.merge(left,right)

  key1 key2   A   B   C   D
0   K5   K5  A5  B5  C5  D5
1   K7   K5  A7  B7  C7  D7

In [70]:
dd=pd.merge(left,right,how='outer',on=['key1','key2'])

In [71]:
dd

  key1 key2    A    B    C    D
0   K5   K5   A5   B5   C5   D5
1   K6   K5  NaN  NaN   C6   D6
2   K6   K6   A6   B6  NaN  NaN
3   K7   K5   A7   B7   C7   D7
4   K8   K5  NaN  NaN   C8   D8
5   K8   K6   A8   B8  NaN  NaN

In [72]:
dd.fillna('*')

  key1 key2   A   B   C   D
0   K5   K5  A5  B5  C5  D5
1   K6   K5   *   *  C6  D6
2   K6   K6  A6  B6   *   *
3   K7   K5  A7  B7  C7  D7
4   K8   K5   *   *  C8  D8
5   K8   K6  A8  B8   *   *

In [74]:
left=pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']},index=['K0','K1','K2','K3'])
right=pd.DataFrame({'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},index=['K0','K1','K2','K3'])

In [76]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [78]:
left.join(right,how='outer')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [79]:
import numpy as  np
import pandas as pd

In [80]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [81]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [82]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [83]:
df['col2'].unique()

array([444, 555, 666])

In [85]:
df['col2'].nunique()

3

In [86]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [87]:
df['col1'].nunique()

4

In [88]:
df['col3'].nunique()

4

In [89]:
print(df['col3'])

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [90]:
print(len(df['col3']))

4

In [91]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [92]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [95]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [96]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [97]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [98]:
# Apply methode.
def times2(x):
    return x*2

In [99]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [101]:
def times2(x):

    return x*2

In [103]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [104]:
df['col3'].apply(times2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [107]:
def anoop(x):
    return x*2  # this is counstom function.

In [108]:
df['col1'].apply(anoop)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [109]:
df['col2'].apply(anoop)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [110]:
df['col3'].apply(anoop)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [111]:
df['col1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [112]:
df['col2'].apply(lambda x:x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [114]:
df['col3'].apply(lambda x:x*2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [116]:
df['col1'].apply(lambda x:x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [117]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [118]:
df.drop('col1',axis=1,inplace=True)

In [119]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [120]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [122]:
df.drop(0,axis=0)

   col2 col3
1   555  def
2   666  ghi
3   444  xyz

In [123]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [124]:
df.drop(0,axis=0,inplace=True)

In [125]:
df

   col2 col3
1   555  def
2   666  ghi
3   444  xyz

In [126]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [127]:
df.index

RangeIndex(start=1, stop=4, step=1)

In [128]:
df

   col2 col3
1   555  def
2   666  ghi
3   444  xyz

In [131]:
df.sort_values('col3')

   col2 col3
1   555  def
2   666  ghi
3   444  xyz

In [132]:
df.sort_values('col2')

   col2 col3
3   444  xyz
1   555  def
2   666  ghi

In [133]:
df.isnull()

    col2   col3
1  False  False
2  False  False
3  False  False

In [134]:
data={'A':['foo','foo','foo','bar','bar','bar'],
      'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
     'D':[1,3,2,5,4,1]}

In [135]:
df=pd.DataFrame(data)

In [136]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [137]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [142]:
import pandas as pd
import numpy as np

In [145]:
from numpy.random import randn

In [146]:
print(np.__version__)

2.2.2

In [147]:
print(np.__version__)

2.2.2

In [148]:
np.random.seed(101)

In [149]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [150]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [159]:
new=df.pivot_table(values='W',index=['W','X','Y','Z'],columns=['A'])

In [160]:
new

          W         X         Y         Z
A  0.190794  1.978757  2.605967  0.683509
W  2.706850  0.628133  0.907969  0.503826
X  0.651118 -0.319318 -0.848077  0.605965
Y -2.018168  0.740122  0.528813 -0.589001
Z  0.188695 -0.758872 -0.933237  0.955057

In [161]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [163]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [171]:
# df.pivot_table(values='W',index=['W','X','Y','Z'],column=['A','B','C','D','E'])

In [172]:
import numpy as np
import pandas as pd

In [173]:
data={'A':['foo','foo','foo','bar','bar','bar'],
      'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
     'D':[1,3,2,5,4,1]}

In [174]:
df=pd.DataFrame(data)

In [175]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [7]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df.transpose()

          A         B         C         D         E
W  2.706850  0.651118 -2.018168  0.188695  0.190794
X  0.628133 -0.319318  0.740122 -0.758872  1.978757
Y  0.907969 -0.848077  0.528813 -0.933237  2.605967
Z  0.503826  0.605965 -0.589001  0.955057  0.683509